outputs/openfoam_cases/0009/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            1.96;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.97;
    Tp                  24.58;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
3.83443
9.01029
16.4281
25.1432
34.8047
46.8306
64.1111
88.5752
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0293334
0.0308663
0.0323542
0.0337754
0.0351091
0.0363359
0.0374378
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        0.141355
        0.197472
        0.248703
        0.291882
        0.329964
        0.36892
        0.410194
        0.445116
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0285556
        0.0300999
        0.0316103
        0.0330648
        0.0344422
        0.0357225
        0.0368868
        0.0379184
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0153742 0 0)
        (0.0162196 0 0)
        (0.0170487 0 0)
        (0.0178492 0 0)
        (0.0186094 0 0)
        (0.0193177 0 0)
        (0.0199636 0 0)
        (0.0205371 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
